Repository: Better-Help-Organization/navithera_therapist
Catalog: lib/l10n/app_*.arb
Languages: am

source: Language
am: ቋንቋ

source: Manage Account
am: መለያ አስተዳደር

source: Contact Us
am: አግኙን

source: More
am: ተጨማሪ

source: Logout
am: ውጣ

source: Tools
am: መሣሪያዎች

source: Update Profile
am: መገለጫ አዘምን

source: Profile
am: መገለጫ

source: Avatar
am: አባባል

source: Student ID
am: የተማሪ መታወቂያ

source: Personal Details
am: የግል ዝርዝሮች

source: First Name
am: የመጀመሪያ ስም

source: Last Name
am: የአያት ስም

source: Email Address
am: የኢሜል አድራሻ

source: Phone Number
am: የስልክ ቁጥር

source: Identify As
am: እንደ

source: Male
am: ወንድ

source: Female
am: ሴት

source: Save Changes
am: ለውጦችን አስቀምጥ

# verifyStudentProfile
source: Verify your student profile to gain access to special discounts on features and services
am: ተማሪ መገለጫዎን ያረጋግጡ እና ልዩ ቅናሾችን ያግኙ

# youllEnjoyBenefits
source: You'll enjoy benefits such as
am: የሚከተሉትን ጥቅሞች ይደሰታሉ

# discountOffer
source: Up to 50% discount on qualified sessions
am: በብቃት ያላቸው ክፍለ ጊዜዎች ላይ እስከ 50% ቅናሽ

# representationOpportunity
source: An opportunity to represent Navithera in your chosen institutions
am: በተመረጡት ተቋማት ውስጥ ናቪቴራን ወክለው የመወከል እድል

source: Apply Now
am: አሁን ያመልክቱ

source: Learn More
am: ተጨማሪ ይወቁ

source: Diary
am: ቀን መረጃ

source: Breath Exercise
am: የመተንፈሻ ልምምድ

source: Meditate
am: ማሰላሰል

# documentThoughts
source: Document your thoughts securely
am: አስተያየቶችዎን በደህንነት ይመዝግቡ

# reduceAnxiety
source: Reduce anxiety and panic attacks
am: ትኩሳት እና ድንጋጤ ይቀንሱ

# guidedMeditation
source: Guided meditation resources
am: የተመራ ማሰላሰል ሀብቶች

# toolsResources
source: Tools and resources
am: መሣሪያዎች እና ሀብቶች

# noJournalEntries
source: No journal entries yet
am: የቀን መረጃ ገቢያ አልተገኘም

# addFirstEntry
source: Tap the + button to add your first entry
am: መጀመሪያውን ገቢያ ለመጨመር + ን ይንኩ

source: My Journal
am: የእኔ ቀን መረጃ

source: Enter title
am: ርዕስ ያስገቡ

source: Let it pour
am: ይፈስ

source: Today's musing
am: የዛሬው አስተያየት

source: Save note
am: ማስታወሻ አስቀምጥ

# guidedMeditationResources
source: Guided meditation
am: የተመራ ማሰላሰል

# curatedSounds
source: Select from our list of curated sounds for you
am: ለእርስዎ የተዘጋጁ ድምፆችን ይምረጡ

source: My Clients
am: ደንበኞቼ

# howAreYouFeeling
source: How are you feeling today
am: ዛሬ ስሜትዎ እንዴት ነው?

source: Tired
am: የደከምኩ

source: Happy
am: ደስተኛ

source: Sad
am: ሐዘናማ

source: Angry
am: ተናደደ

# areYouSureLogout
source: Are you sure you want to logout
am: እርግጠኛ ነዎት መውጣት ይፈልጋሉ?

source: Cancel
am: ሰርዝ

source: Login
am: ግባ

# welcomeMessage
source: We've missed you, kindly punch in your details
am: ናፍቀንሃል፣ የእርስዎን ዝርዝሮች ያስገቡ!

# dontHaveAccount
source: Don't have an account
am: መለያ የሎትህ?

source: Sign up
am: ይመዝገቡ

# createAccount
source: Create an account
am: መለያ ይፍጠሩ

# getStarted
source: Let's get you started with quality mental health support
am: በብቃት ያለ የአእምሮ ጤና ድጋፍ እንጀምር

# termsAgreement
source: By creating an account, you confirm you agree to the Navithera
am: መለያ በመፍጠር በናቪቴራ

# termsAndPrivacy
source: Terms of Use and Privacy Policy
am: የአጠቃቀም ውሎች እና የግላዊነት ፖሊሲ እንደምትስማሙ ያረጋግጣሉ

# alreadyHaveAccount
source: Already have an account
am: ቀድሞ መለያ አለዎት?

source: You deserve to feel better
am: ተስማሚ ስሜት የሚሰማዎት ይገባዎታል

# carrySomethingMessage
source: Everyone carries something. Now, you don't have to carry it alone. You're safe here
am: ሁሉም ሰው የሆነ ነገር ይሸከማል። አሁን ብቻዎት ልትሸከሙት አያስፈልግዎትም። እዚህ ደህና ነዎት።

source: Talk. Heal. Grow.
am: ንገሩ። ይድኑ። ያድጉ።

# guidedSessionsDescription
source: In small, guided sessions, you'll be heard, supported, and empowered to move forward.
am: በትናንሽ የተመራ ክፍለ ጊዜያት ውስጥ ይሰማዎታል፣ ይደገፉዎታል እና ወደፊት እንዲሄዱ ኃይል ይሰጥዎታል።

source: Your Journey Starts Now
am: ጉዞዎ አሁን ይጀምራል

# healingJourneyDescription
source: It's time to take care of your mind. Start your healing journey with us—safe, private, and focused on you.
am: አእምሮዎን ለማንከባከብ ጊዜው አሁን ነው። ከእኛ ጋር የማዳን ጉዞዎን ይጀምሩ - ደህንነቱ የተጠበቀ፣ የግል እና በእርስዎ ላይ ተተኮሰ።

source: Next
am: ቀጣይ

source: Skip
am: ዝለል

# getStarted2
source: Get started
am: ጀምር

# selfEsteemQuote
source: Self-esteem is as important to our well-being as legs are to a table. It is essential for physical and mental health and for happiness.
am: ራስን የመከበር ስሜት ለደህንነታችን እንደ ጠረጴዛ እግሮች ለጠረጴዛው ያለው ጠቀሜታ አለው። ለአካላዊ እና ለአእምሮ ጤና እንዲሁም ለሰላም ስሜት አስፈላጊ ነው።

source: Share
am: አጋራ

source: Home
am: ቤት

source: My Therapist
am: የእኔ ሐኪም

source: Notification
am: ማስታወቂያ

source: Gift Therapy
am: ህክምና ስጦታ

# xnew
source: New
am: አዲስ

source: Livechat Support
am: ቀጥታ ውይይት ድጋፍ

source: Email Us
am: ኢሜል ይላኩልን

source: Call Us
am: ይደውሉልን

source: Calendar
am: ቀን መቁጠሪያ

source: Feedback and Bug Reports
am: ግብረ መልስ እና ስህተቶች ሪፖርት

# joinNavithera
source: Join Navithera — Empower Change
am: አፍላጊ

# connectWithClients
source: Connect with clients seeking your expertise and make a real impact.
am: ናቪተራን ይቀላቀሉ — ለለውጥ ኃይል ይሁኑ

# workSmarter
source: Work Smarter, Not Harder
am: ናቪተራን ይቀላቀሉ — ለለውጥ ኃይል ይሁኑ

# setYourHours
source: Set your own hours, connect easily with clients, and focus on what you do best.
am: ናቪተራን ይቀላቀሉ — ለለውጥ ኃይል ይሁኑ

# supportedByAI
source: Supported by AI, Driven by You
am: ናቪተራን ይቀላቀሉ — ለለውጥ ኃይል ይሁኑ

# leverageSmartTools
source: Leverage smart tools to enhance therapy sessions and deliver personalized care.
am: ናቪተራን ይቀላቀሉ — ለለውጥ ኃይል ይሁኑ

source: Good evening
am: እንደምን አደርክ

source: Good Morning
am: እንደምን አደሩ

source: Good Afternoon
am: እንደምን ዋሉ

source: Good Night
am: እንደምን አመሹ
